Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_trade_union_membership.html.txt.tmx
Source language: en
Languages: ga

source: Gerry has been working part-time (10 hours a week) for 6 months with a takeaway restaurant
ga: Tá Gerry ag obair go páirtaimseartha (10 n-uaire in aghaidh na seachtaine) le 6 mhí anuas i mbialann mearbhia

source: He decides that he will join a trade union because the conditions in the job are bad
ga: Socraíonn sé ballraíocht a ghlacadh le ceardchumann toisc go bhfuil coinníollacha sa phost go dona

source: None of the other employees is in a union
ga: Níl duine ar bith de na fostaithe eile i gceardchumann

source: He is showing some information he got from the union to a fellow employee when his employer comes into the takeaway and sees what Gerry is doing
ga: Tá sé ag taispeáint faisnéise a fuair sé ón gceardchumann do chomhghleacaí leis nuair a thagann a fhostóir isteach sa bhialann mearbhia agus tugann sé faoi deara cad atá ar siúl ag Gerry

source: At finishing time that day, the employer tells Gerry he no longer needs his services as demand has dropped
ga: Ag deireadh an lae oibre, deireann an fostóir le Gerry nach bhfuil a chuid seirbhísí ag teastáil níos mó toisc titim ar chúrsaí éilimh

source: What rights does Gerry have?
ga: Cad iad na cearta atá ag Gerry?

source: Gerry has been working for the employer for less than a year, so in normal circumstances he would not be able to bring a claim for unfair dismissal
ga: Tá níos lú ná bliain caite ag Gerry ag obair don fhostóir, agus faoi ghnáthchúinsí ní bheadh sé ábalta éileamh a dhéanamh maidir le dífhostú éagórach

source: However, this requirement does not apply to a dismissal for trade union activity
ga: Mar sin féin, ní bhaineann an riachtanas seo le dífhostú toisc gníomhaíocht cheardchumainn

source: It would appear that Gerry’s dismissal is related to his employer’s discovery that he had been in contact with a union
ga: Is cosúil go bhfuil dífhostú Gerry bainteach leis an bhfostóir ag fáil amach go raibh teagmháil aige le ceardchumann

source: This gives Gerry a strong case to argue that this discovery was the reason for the dismissal and not a drop in demand
ga: Tá cás láidir ag Gerry dá réir le cruthú gurb í seo cúis an dífhostaithe agus ní titim ar chúrsaí éilimh

source: Gerry could bring his case for unfair dismissal to the Workplace Relations Commission using the online complaint form available on workplacerelations.ie
ga: Ba chóir do Gerry a iarratas ar dhífhostú éagórach ag eascairt ó ghníomhaíocht cheardchumainn a thabhairt faoi bhráid an Choimisiúin um Chaidreamh san Áit Oibre tríd an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie
